
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//+++Захарова
	
	//Исходный код
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
	//НовыйКод: Область "ДороботкиФормы"
	ДЗ_РассчитатьСуммуСтроки(ТекущиеДанные);
	
	//---Захарова
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти 

#Область ДЗ_ДоработкиФормы
//+++Захарова: Доработка Документа "ЗаказПокупателя" с учётом "Согласованной скидки"

&НаКлиенте
Процедура ДЗ_РассчитатьСуммуСтроки(ТекущиеДанные)
//+++Захарова: Доработка Документа "ЗаказПокупателя" с учётом "Согласованной скидки"
//Доработка исходной процедуры "РассчитатьСуммуСтроки"
	
	Если ЗначениеЗаполнено(Объект.ДЗ_СогласованнаяСкидка) Тогда
		
		Если ЗначениеЗаполнено(Объект.Товары) Или ЗначениеЗаполнено(Объект.Услуги) Тогда
			СуммаБезСкидки = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
			СуммаСкидки = (СуммаБезСкидки * Объект.ДЗ_СогласованнаяСкидка) / 100;
			ТекущиеДанные.Сумма = СуммаБезСкидки - СуммаСкидки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДЗ_СогласованнаяСкидка) Тогда 
		
		ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
		
	КонецЕсли;
	
//---Захарова
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДЗ_ПриИзмененииСогласованнаяСкидка(Элемент)
//+++Захарова: Доработка Документа "ЗаказПокупателя" с учётом "Согласованной скидки"
//Создание процедуры "ПриИзменении" Реквизита "СогласованнаяСкидка" для пересчета таблиц
	
	Если ЗначениеЗаполнено(Объект.Товары) Или ЗначениеЗаполнено(Объект.Услуги) Тогда
		
		ТекстВопроса = "Изменен процент скидки. Пересчитать таблицу?";
		Ответ = Ждать ВопросАсинх(ТекстВопроса,РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда 
			ДЗ_ПересчитатьТаблицыТоварыУслугиСУчетомСкидки();
		КонецЕсли;
		
		РассчитатьСуммуДокумента(); 
		
	КонецЕсли;
	
//---Захарова
КонецПроцедуры

&НаКлиенте
Процедура ДЗ_КомандаПересчитатьТаблицу (Команда)
//+++Захарова: Доработка Документа "ЗаказПокупателя" с учётом "Согласованной скидки"
//Создание процедуры для Команды "ПересчитатьТаблицу" для пересчета таблиц
	
	Если ЗначениеЗаполнено(Объект.Товары) Или ЗначениеЗаполнено(Объект.Услуги) Тогда
		ДЗ_ПересчитатьТаблицыТоварыУслугиСУчетомСкидки();
		РассчитатьСуммуДокумента();
	КонецЕсли;
	
//---Захарова
КонецПроцедуры

&НаКлиенте
Процедура ДЗ_ПересчитатьТаблицыТоварыУслугиСУчетомСкидки()
//+++Захарова: Доработка Документа "ЗаказПокупателя" с учётом "Согласованной скидки"
//Пересчитать Таблицу "Товары" и Таблицу "Услуги" с учётом "Согласованной скидки"
	
	Если ЗначениеЗаполнено(Объект.Товары) Тогда
		Для Каждого СтрокаТаблицыТовары Из Объект.Товары Цикл
			ДЗ_РассчитатьСуммуСтроки(СтрокаТаблицыТовары);
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Услуги) Тогда
		Для Каждого СтрокаТаблицыУслуги Из Объект.Услуги Цикл
			ДЗ_РассчитатьСуммуСтроки(СтрокаТаблицыУслуги);
		КонецЦикла;
	КонецЕсли;
	
//---Захарова
КонецПроцедуры

//---Захарова
#КонецОбласти

